const COLS = 10;
const ROWS = 20;
const BLOCK_SIZE = 30;

// 키코드로 키매핑
const KEY = {
  ESC: 27,
  SPACE: 32,
  LEFT: 37,
  UP: 38,
  RIGHT: 39,
  DOWN: 40,
  P: 80,
  Q: 81
}
// 불변으로 만드는 값은 1레벨에서만 동작한다 -> 객체 안에 하위의 객체는 불변하게 만들 수 없다.
Object.freeze(KEY);

const SHAPES = [
  [], // 
  [[0, 0, 0, 0], //I
   [1, 1, 1, 1], 
   [0, 0, 0, 0], 
   [0, 0, 0, 0]],
  [[2, 0, 0], //J
   [2, 2, 2], 
   [0, 0, 0]],
  [[0, 0, 3],//L
   [3, 3, 3],
   [0, 0, 0]],
  [[4, 4], //O
   [4, 4]],
  [[0, 5, 5], //S
   [5, 5, 0], 
   [0, 0, 0]],
  [[0, 6, 0], //T
   [6, 6, 6], 
   [0, 0, 0]],
  [[7, 7, 0], //N
   [0, 7, 7], 
   [0, 0, 0]]
];
Object.freeze(SHAPES);